In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import pylab as pl

In [7]:
df=pd.read_csv('agora.csv')

df

# CHECK NULL VALUE

In [9]:
df.isnull().sum()

Markeitng Spend    0
Admin              0
Transport          1
Area               0
Profit             0
dtype: int64

# HANDLE NULL VALUES

In [14]:
mean=df.Transport.mean()
median=df.Transport.median()
print(mean)
print(median)

416262.6675
413549.075

In [15]:
df.Transport=df.Transport.fillna(median)

In [16]:
df.Transport

0    471784.100
1    443898.530
2    413549.075
3    366168.420
4    383199.620
Name: Transport, dtype: float64

In [17]:
df.isnull().sum()

Markeitng Spend    0
Admin              0
Transport          0
Area               0
Profit             0
dtype: int64

# ENCODING

In [20]:
df.Area
df.Area.unique()

array(['DHAKA', 'CTG', 'RANGPUR'], dtype=object)

0      DHAKA
1        CTG
2    RANGPUR
3      DHAKA
4    RANGPUR
Name: Area, dtype: object

In [22]:
#REPLACE UNIQUE VALUES
df.Area=df.Area.replace(['DHAKA','CTG','RANGPUR'],[0,1,2])

In [23]:
df.Area

0    0
1    1
2    2
3    0
4    2
Name: Area, dtype: int64

# LABEL ENCODING

In [24]:
from sklearn.preprocessing import LabelEncoder

In [25]:
label=LabelEncoder()

In [26]:
df=pd.read_csv('agora.csv')

In [27]:
df

   Markeitng Spend      Admin  Transport     Area  Profit
0        114523.61  136897.80  471784.10    DHAKA   50000
1        162597.70  151377.59  443898.53      CTG   60000
2        153441.51  101145.55        NaN  RANGPUR   70000
3        144372.41  118671.85  366168.42    DHAKA   80000
4        142107.34   91391.77  383199.62  RANGPUR   90000

In [28]:
df.Area=label.fit_transform(df.Area)

In [29]:
df.Area

0    1
1    0
2    2
3    1
4    2
Name: Area, dtype: int32

In [30]:
df

   Markeitng Spend      Admin  Transport  Area  Profit
0        114523.61  136897.80  471784.10     1   50000
1        162597.70  151377.59  443898.53     0   60000
2        153441.51  101145.55        NaN     2   70000
3        144372.41  118671.85  366168.42     1   80000
4        142107.34   91391.77  383199.62     2   90000

In [39]:
#LABEL ENCODING USING FOR LOOP
df=pd.read_csv('agora.csv')
df

   Markeitng Spend      Admin  Transport     Area  Profit
0        114523.61  136897.80  471784.10    DHAKA   50000
1        162597.70  151377.59  443898.53      CTG   60000
2        153441.51  101145.55        NaN  RANGPUR   70000
3        144372.41  118671.85  366168.42    DHAKA   80000
4        142107.34   91391.77  383199.62  RANGPUR   90000

In [40]:
for column in df.columns:
    if df[column].dtype==np.number:
        continue
    df[column]=LabelEncoder().fit_transform(df[column])

C:\Users\HP\AppData\Local\Temp\ipykernel_19340\3181237920.py:2: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.
  if df[column].dtype==np.number:
C:\Users\HP\AppData\Local\Temp\ipykernel_19340\3181237920.py:2: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.
  if df[column].dtype==np.number:

In [41]:
df.Area

0    1
1    0
2    2
3    1
4    2
Name: Area, dtype: int32

# ONE HOT ENCODING

In [67]:
df=pd.read_csv('agora.csv')
mean=df.Transport.mean()
median=df.Transport.median()
print(mean)
print(median)
df.Transport=df.Transport.fillna(median)

416262.6675
413549.075

In [68]:
dummy_variables=pd.get_dummies(df['Area'], drop_first=True)

In [69]:
dummy_variables

   DHAKA  RANGPUR
0      1        0
1      0        0
2      0        1
3      1        0
4      0        1

In [70]:
new_df=df.drop('Area',axis=1)

In [71]:
new_df

   Markeitng Spend      Admin   Transport  Profit
0        114523.61  136897.80  471784.100   50000
1        162597.70  151377.59  443898.530   60000
2        153441.51  101145.55  413549.075   70000
3        144372.41  118671.85  366168.420   80000
4        142107.34   91391.77  383199.620   90000

In [72]:
df=pd.concat([new_df,dummy_variables],axis=1)

In [73]:
df

   Markeitng Spend      Admin   Transport  Profit  DHAKA  RANGPUR
0        114523.61  136897.80  471784.100   50000      1        0
1        162597.70  151377.59  443898.530   60000      0        0
2        153441.51  101145.55  413549.075   70000      0        1
3        144372.41  118671.85  366168.420   80000      1        0
4        142107.34   91391.77  383199.620   90000      0        1

In [74]:
#NOW APPLY MULTIPLE LINEAR REGRESSION TO PREDICT PROFIT
df.describe

<bound method NDFrame.describe of    Markeitng Spend      Admin   Transport  Profit  DHAKA  RANGPUR
0        114523.61  136897.80  471784.100   50000      1        0
1        162597.70  151377.59  443898.530   60000      0        0
2        153441.51  101145.55  413549.075   70000      0        1
3        144372.41  118671.85  366168.420   80000      1        0
4        142107.34   91391.77  383199.620   90000      0        1>

In [75]:
df.shape

(5, 6)

In [76]:
cdf=df[['Markeitng Spend','Admin','Transport','DHAKA','RANGPUR','Profit']]

In [78]:
#train
msk=np.random.rand(len(cdf))<0.8
train=cdf[msk]
test=cdf[~msk]

In [79]:
#Model Selection
from sklearn import linear_model
regr=linear_model.LinearRegression()
train_x=np.asanyarray(train[['Markeitng Spend','Admin','Transport','DHAKA','RANGPUR']])
train_y=np.asanyarray(train[['Profit']])

regr.fit(train_x,train_y)

LinearRegression()

In [80]:
y_hat= regr.predict(test[['Markeitng Spend','Admin','Transport','DHAKA','RANGPUR']])
x = np.asanyarray(test[['Markeitng Spend','Admin','Transport','DHAKA','RANGPUR']])
y = np.asanyarray(test[['Profit']])
print("Residual sum of squares: %.2f"
      % np.mean((y_hat - y) ** 2))

# Explained variance score: 1 is perfect prediction
print('Variance score: %.2f' % regr.score(x, y))

Residual sum of squares: 108042846.53
Variance score: -0.08

C:\ProgramData\anaconda3\lib\site-packages\sklearn\base.py:413: UserWarning: X has feature names, but LinearRegression was fitted without feature names
  warnings.warn(

# ORDINAL ENCODER

In [81]:
df=pd.read_csv('agora.csv')

In [82]:
df

   Markeitng Spend      Admin  Transport     Area  Profit
0        114523.61  136897.80  471784.10    DHAKA   50000
1        162597.70  151377.59  443898.53      CTG   60000
2        153441.51  101145.55        NaN  RANGPUR   70000
3        144372.41  118671.85  366168.42    DHAKA   80000
4        142107.34   91391.77  383199.62  RANGPUR   90000

In [83]:
df.head()

   Markeitng Spend      Admin  Transport     Area  Profit
0        114523.61  136897.80  471784.10    DHAKA   50000
1        162597.70  151377.59  443898.53      CTG   60000
2        153441.51  101145.55        NaN  RANGPUR   70000
3        144372.41  118671.85  366168.42    DHAKA   80000
4        142107.34   91391.77  383199.62  RANGPUR   90000

In [85]:
from sklearn.preprocessing import OrdinalEncoder

In [86]:
df.Area.unique()

array(['DHAKA', 'CTG', 'RANGPUR'], dtype=object)

In [87]:
city_list=['DHAKA','CTG','RANGPUR']

In [88]:
ordinal=OrdinalEncoder(categories=[city_list])

In [94]:
encoded_values=ordinal.fit_transform(df[['Area']])

In [97]:
new_Area=pd.DataFrame(encoded_values, columns=['Area'])

In [98]:
new_Area

   Area
0   0.0
1   1.0
2   2.0
3   0.0
4   2.0

In [99]:
df

   Markeitng Spend      Admin  Transport     Area  Profit
0        114523.61  136897.80  471784.10    DHAKA   50000
1        162597.70  151377.59  443898.53      CTG   60000
2        153441.51  101145.55        NaN  RANGPUR   70000
3        144372.41  118671.85  366168.42    DHAKA   80000
4        142107.34   91391.77  383199.62  RANGPUR   90000

In [102]:
df.Area=new_Area

In [103]:
df

   Markeitng Spend      Admin  Transport  Area  Profit
0        114523.61  136897.80  471784.10   0.0   50000
1        162597.70  151377.59  443898.53   1.0   60000
2        153441.51  101145.55        NaN   2.0   70000
3        144372.41  118671.85  366168.42   0.0   80000
4        142107.34   91391.77  383199.62   2.0   90000

# HASHING AREA

In [104]:
df=pd.read_csv('agora.csv')

In [106]:
df

   Markeitng Spend      Admin  Transport     Area  Profit
0        114523.61  136897.80  471784.10    DHAKA   50000
1        162597.70  151377.59  443898.53      CTG   60000
2        153441.51  101145.55        NaN  RANGPUR   70000
3        144372.41  118671.85  366168.42    DHAKA   80000
4        142107.34   91391.77  383199.62  RANGPUR   90000

In [109]:
import category_encodes as ce

ModuleNotFoundError: No module named 'category_encode'

In [108]:
encoder=ce.HashingEncoder(cols='Area')

NameError: name 'ce' is not defined